//*--------------------------------------------------------------*//
//= @file   名前:GameClear.cpp
//=
//= @brief  概要:クリア処理のソースファイル
//=
//= @date   日付:2016/2/4
//=
//= @author 製作者:ShutaFurukawa
//*--------------------------------------------------------------*//

// ヘッダファイルの読み込み ================================================
#include "GameMain.h"
#include "GameClear.h"

// 名前空間
using namespace DirectX::SimpleMath;
using namespace DirectX;


//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//----------------------------------------------------------------------
GameClear::GameClear()
{
	//カウント初期化
	cnt = 0;

}

//----------------------------------------------------------------------
//! @brief デストラクタ
//----------------------------------------------------------------------
GameClear::~GameClear(void)
{

}


//----------------------------------------------------------------------
//! @brief ゲームクリア処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameClear::Update(void)
{
	cnt++;

	//スペースキーでタイトルに遷移
	if (g_keyTracker->pressed.Space)
	{
		g_NextScene = TITLE;

	}

}


//----------------------------------------------------------------------
//! @brief ゲームクリア描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameClear::Render(void)
{
	wchar_t buf[256];	//文字列編集用

	swprintf_s(buf, 256, L"CLEAR");		//文字列編集
	//文字の描画
	g_spriteFont->DrawString(g_spriteBatch.get(), buf, Vector2(100, 0));


}


