//*--------------------------------------------------------------*//
//= @file   名前:GameOver.h
//=
//= @brief  概要:ゲームオーバー処理のヘッダファイル
//=
//= @date   日付:2016/2/4
//=
//= @author 製作者:ShutaFurukawa
//*--------------------------------------------------------------*//

// ヘッダファイルの読み込み ================================================
#include "GameMain.h"
#include "GameOver.h"

//名前空間
using namespace DirectX::SimpleMath;
using namespace DirectX;

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//----------------------------------------------------------------------
GameOver::GameOver()
{
	//カウント初期化
	cnt = 0;

}

//----------------------------------------------------------------------
//! @brief デストラクタ
//----------------------------------------------------------------------
GameOver::~GameOver(void)
{

}

//----------------------------------------------------------------------
//! @brief ゲームオーバー処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameOver::Update(void)
{
	//スペースキーでタイトルに遷移
	if (g_mouseTracker->leftButton)
	{
		g_NextScene = PLAY;

	}

}


//----------------------------------------------------------------------
//! @brief ゲームオーバー描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameOver::Render(void)
{
	wchar_t buf[256];	//文字列編集用

	swprintf_s(buf, 256, L"OVER");		//文字列編集
	g_spriteFont->DrawString(g_spriteBatch.get(), buf, Vector2(100, 0));

}

