//*--------------------------------------------------------------*//
//= @file   名前:GameTitle.cpp
//=
//= @brief  概要:タイトル処理のヘッダファイル
//=
//= @date   日付:2016/2/4
//=
//= @author 製作者:ShutaFurukawa
//*--------------------------------------------------------------*//

// ヘッダファイルの読み込み ================================================
#include "GameMain.h"
#include "GameTitle.h"

using namespace DirectX::SimpleMath;
using namespace DirectX;

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//----------------------------------------------------------------------
GameTitle::GameTitle()
{
	//カウント初期化
	cnt = 0;

}

//----------------------------------------------------------------------
//! @brief デストラクタ
//----------------------------------------------------------------------
GameTitle::~GameTitle(void)
{

}


//----------------------------------------------------------------------
//! @brief タイトル処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameTitle::Update(void)
{
	//カウント計測
	cnt++;

	//スペースキーでプレイに遷移
	if (g_keyTracker->pressed.Space)
	{
	}
}

//----------------------------------------------------------------------
//! @brief タイトル描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void GameTitle::Render(void)
{

}


